sources/Documents/ФормированиеДневногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ФормированиеДневногоРасписания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Расписание</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Пары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолвоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тарифицированное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Совмещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дз</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВторойПреподаватель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПары</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аттестация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

sources/Documents/ФормированиеДневногоРасписания/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПарыВторойПреподавательПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекДанные.ВторойПреподаватель) Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТекДанные.Совмещение = Ложь;
	
	 КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПарыТарифицированноеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 

	 Если ТекДанные.Тарифицированное Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТарифицированоВСистеме = РаботаСКонтингентом.ИмеетсяТарификацияДляГруппыПредмета(ТекДанные.Группа, ТекДанные.Предмет, Объект.Дата);
	     Если Не ТарифицированоВСистеме Тогда
		 
		 	 ТекДанные.Тарифицированное = Ложь;
		 
		 КонецЕсли;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПарыЗаменаПриИзменении(Элемент)
	ТекДанные = Элементы.Пары.ТекущиеДанные; 

	 Если ТекДанные.Тарифицированное Тогда
	
		 ТекДанные.Замена = Ложь;
	
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПарыСовмещениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Пары.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекДанные.ВторойПреподаватель) Тогда
	
		 ТекДанные.Замена = Ложь;
		 ТекДанные.Совмещение = Ложь;
	
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНовоеВремяЗвонков(Команда)
	ОткрытьФорму("Документ.ФормированиеВремениЗвонков.Форма.ФормаДокумента",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПарыПредметНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода(); 
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Преподаватель", РаботаССеансом.ПолучитьТекПользователя());
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ПериодУчебы", УчебныйГод.Период);
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры; 
	
КонецПроцедуры
